In [1]:
import pandas as pd #importa a biblioteca pandas

In [39]:
dicionario1 = {
    'A':[1,2,3],
    'B':[-32,-21,15],
    'C':[60,10,20],
    'Chave':['AA', 'BB', 'CC']
}
dicionario2 = {
    'A':[6,7,8],
    'B':[-39,-28,-17],
    'C':[1000,10,60],
    'Chave':['AA','BB','CC']
}
dicionario3 = {
    'A':[11,12,13],
    'B':[-39,-22,-11],
    'C':[30,10,20],
    'Chave':['AA','BB','CC']
}

In [40]:
#criando varias listas para serem labels
label1 = ['1º linha', '2º linha', '3º linha']
label2 = ['4º linha', '5º linha', '6º linha']
label3 = ['7º linha', '8º linha', '9º linha']

In [41]:
#estruturando as bases de dados
dataframe1 = pd.DataFrame(dicionario1, index=label1)
dataframe2 = pd.DataFrame(dicionario2, index=label2)
dataframe3 = pd.DataFrame(dicionario3, index=label3)

In [42]:
dataframe1.head()

          A   B   C Chave
1º linha  1 -32  60    AA
2º linha  2 -21  10    BB
3º linha  3  15  20    CC

In [43]:
dataframe2.head()

          A   B     C Chave
4º linha  6 -39  1000    AA
5º linha  7 -28    10    BB
6º linha  8 -17    60    CC

In [44]:
dataframe3.head()

           A   B   C Chave
7º linha  11 -39  30    AA
8º linha  12 -22  10    BB
9º linha  13 -11  20    CC

In [45]:
#Juntando os datframes utilizando o comando concat
#Esse comando ira empilhar os dataframes 
df_n = pd.concat([dataframe1,dataframe2,dataframe3])

In [46]:
df_n.head()

          A   B     C Chave
1º linha  1 -32    60    AA
2º linha  2 -21    10    BB
3º linha  3  15    20    CC
4º linha  6 -39  1000    AA
5º linha  7 -28    10    BB

In [47]:
df_n2 = pd.merge(dataframe1,dataframe2,how='inner', on='Chave')

In [48]:
df_n2.head()

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3   15   20    CC    8  -17    60

In [52]:
df_n3 = pd.merge(dataframe1,dataframe3,how='right', on='Chave')

In [53]:
df_n3.head()
#merge verificando a semelhança com a chave presente
# ao lado direito do dataframe

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3   15   20    CC   13  -11   20

In [67]:
dic1 = {
    'A':[1,2,3],
    'B':[-32,-21,-15],
    'C':[60,10,20]
}
dic2 = {
    'D':[6,7,8],
    'E':[-39,-38,-17],
    'F':[1000,10,60]
}
label_1 = ['1º linha', '2º linha', '3º linha']# cria o label
dtf1 = pd.DataFrame(dic1, index=label_1)
dtf2 = pd.DataFrame(dic2, index=label_1)

In [69]:
dtf1.head()

          A   B   C
1º linha  1 -32  60
2º linha  2 -21  10
3º linha  3 -15  20

In [70]:
dtf2.head()

          D   E     F
1º linha  6 -39  1000
2º linha  7 -38    10
3º linha  8 -17    60

In [71]:
dtf1.join(dtf2) #Junta os dataframes

          A   B   C  D   E     F
1º linha  1 -32  60  6 -39  1000
2º linha  2 -21  10  7 -38    10
3º linha  3 -15  20  8 -17    60

In [72]:
# Exercicio 1
Dataframe_1 = {
    'Nomes':['Alice', 'Julia', 'Bruna', 'Daniel', 'Filipe', 'Silvio'],
    'Idade':[19,22,28,34,28,48],
    'Profissões':['Direito', 'Engenharia', 'Enfermagem', 'Engenheiro Civil', 'Cientista da Computação', 'Engenheiro Eletronico'],
    'id':[1,2,3,4,5,6]
}

In [74]:
df = pd.DataFrame(Dataframe_1)

In [75]:
df.head()

    Nomes  Idade               Profissões  id
0   Alice     19                  Direito   1
1   Julia     22               Engenharia   2
2   Bruna     28               Enfermagem   3
3  Daniel     34         Engenheiro Civil   4
4  Filipe     28  Cientista da Computação   5

In [78]:
# Exercicio 2
Dataframe_2 ={
    'Número de produtos fabricados':[50,30,40,100],
    'Setores':[1,2,3,4]
}

In [79]:
df2 = pd.DataFrame(Dataframe_2)

In [80]:
df2.head()

   Número de produtos fabricados  Setores
0                             50        1
1                             30        2
2                             40        3
3                            100        4

In [101]:
# Exercico 3
Dataframe_3 = {
    'Id':[1,2,3,4],
    'Nome':['Ana', 'Pedro', 'Maria', 'João'],
    'Setores':['Rh', 'Vendas', 'Administrativo', 'Produção']
}
Dataframe_4 = {
    'Id':[1,2,3,4],
    'Salários':[3000,2800,3200,2500]
}

In [102]:
dataf1 = pd.DataFrame(Dataframe_3)

In [103]:
dataf2 = pd.DataFrame(Dataframe_4)

In [104]:
dataf1.head()

   Id   Nome         Setores
0   1    Ana              Rh
1   2  Pedro          Vendas
2   3  Maria  Administrativo
3   4   João        Produção

In [105]:
dataf2.head()

   Id  Salários
0   1      3000
1   2      2800
2   3      3200
3   4      2500

In [134]:
df_n4 = pd.merge(dataf1,dataf2,how='right', on='Id')

In [135]:
df_n4.head()

   Id   Nome         Setores  Salários
0   1    Ana              Rh      3000
1   2  Pedro          Vendas      2800
2   3  Maria  Administrativo      3200
3   4   João        Produção      2500

In [136]:
#Exercicio 4
Dataframes_5 = {
    'Data':['2023-01-01','2023-01-02','2023-01,03'],
    'Produto':['Item A', 'Item B', 'Item A'],
    'Quantidade':[10,5,8],
    'Valor':[100.00,50.00,80.00]
}
Dataframes_6 = {
    'Data':['2023-01-01','2023-01-02','2023-01,03'],
    'Produto':['Item C', 'Item B', 'Item D'],
    'Quantidade':[12,6,3],
    'Valor':[120.00,60.00,30.0]
}

In [137]:
df_n5 = pd.DataFrame(Dataframes_5)
df_n6 = pd.DataFrame(Dataframes_6)

In [138]:
df_n5.head()

         Data Produto  Quantidade  Valor
0  2023-01-01  Item A          10  100.0
1  2023-01-02  Item B           5   50.0
2  2023-01,03  Item A           8   80.0

In [139]:
df_n6.head()

         Data Produto  Quantidade  Valor
0  2023-01-01  Item C          12  120.0
1  2023-01-02  Item B           6   60.0
2  2023-01,03  Item D           3   30.0